tutorials/scalar/multiScalar/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }

application     ibmPimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         200;
// dt = 65 h^2/nu, the final pseudo-time step of the reference notebook
deltaT          0.9907026367931717;
writeControl    runTime;
writeInterval   50;
purgeWrite      2;
writeFormat     ascii;
writePrecision  12;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
adjustTimeStep  no;
