tutorials/scalar/multiScalar/0/d
FoamFile { version 2.0; format ascii; class volScalarField; object d; }
dimensions [0 0 0 1 0 0 0];
internalField uniform 0;
boundaryField
{
    left   { type cyclic; }
    right  { type cyclic; }
    bottom { type cyclic; }
    top    { type cyclic; }
    frontAndBack { type empty; }
}
